{
  "https://hytale.com/news/2025/11/hytale-early-access-january-13-2026": {
    "blocks": [
      {
        "type": "text",
        "content": "Hytale Early Access: January 13, 2026",
        "style": "header"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_cover_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      },
      {
        "type": "text",
        "content": "Hytale enters early access on January 13, 2026.",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Pre-purchase opens December 13, 2025.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Two weeks ago, we, the original founders, repurchased Hytale, months after it was cancelled. We revived the project, and we are returning to a four-year-old legacy build that had been abandoned. We are personally committing funding for many years to come.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "We stepped away from the newer engine, which was intended to be a complete cross-platform rewrite, and we are now focused on reviving the original version. This required picking, choosing, and merging more than 300 GitHub branches into a single working branch. It was a significant engineering effort, but we’re now confident enough to launch early access.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Hytale and Hypixel Studios are independent again, and we are returning to the original vision from the 2018 trailer. Because we went back to an older game build that was now meant for prototypes, some parts of the game will feel behind, but momentum is strong, and we’re working fast to make this into the game we all dreamed of.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Modding and creative tools are in a decent state; however, they’re not where we want them long term. That being said, they’re ready for players who want to create content on day 1. This is a good moment for modders, server owners, and creators to step in early! They will play a significant role in Hytale’s future.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Since the cancellation, we’ve rehired more than 40 former and new team members, bringing the total to 50. Reacquiring a game from a AAA studio and preparing an early access launch within weeks is rare, and players will be able to watch the progress as it happens.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "If you don’t feel comfortable pre-ordering, please don’t. This is true early access, meaning it’s still very much unfinished and will be buggy for a while, but you have my and the team's commitment to make Hytale the game we’ve always wanted it to be.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "The first impression will be rough, but the path ahead matters more. More details are coming soon. Follow our social channels for updates, and we hope to see you on January 13, 2026.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Thank you, everyone, for your support. Hytale has been through a long journey, and soon, we will be home.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "~ Simon and the entire Hytale team",
        "style": "normal"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_477eaf50273a8db52724a3fda19a9bf2_modding_banner.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_14e7ce9586e3303868aee27293ba4591_hytale_cursebreaker_key_art_2k.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_1add7a5021e3a42191a30ddc98653d28_header_spring_2025_dev_update.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5efa372e65522954368269461f0f6c8f_winter2024header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_8784c65ad7551359132cda3879f5e3b0_lp_header.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5c3aa9e9095cfd50aff3f6ca275761b2_summer2024_header_5.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_e82dccfffc8df9677ab407f12e3b781f_tech_blog_flecs_header_updated.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_7c5bb6af44f293be3ff60b318d0b5475_winter_update_header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      }
    ],
    "translated": [
      {
        "type": "text",
        "content": "Ранний доступ Hytale: 13 января 2026 г.",
        "style": "header"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_cover_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      },
      {
        "type": "text",
        "content": "Hytale выйдет в раннем доступе 13 января 2026 года.",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Предварительная покупка откроется 13 декабря 2025 г.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Две недели назад мы, первоначальные основатели, выкупили Hytale, спустя несколько месяцев после его закрытия. Мы возобновили проект и возвращаемся к устаревшей сборке четырехлетней давности, от которой отказались. Мы лично берем на себя обязательства по финансированию на многие годы вперед.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Мы отказались от нового движка, который должен был стать полной кросс-платформенной переработкой, и теперь сосредоточены на возрождении исходной версии. Для этого потребовалось собрать, выбрать и объединить более 300 веток GitHub в одну рабочую ветку. Это была значительная инженерная работа, но теперь мы достаточно уверены в себе, чтобы запустить ранний доступ.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Hytale и Hypixel Studios снова независимы, и мы возвращаемся к первоначальному видению из трейлера 2018 года. Поскольку мы вернулись к более старой сборке игры, которая теперь предназначалась для прототипов, некоторые части игры будут отставать, но темп велик, и мы быстро работаем над тем, чтобы воплотить это в игру, о которой мы все мечтали.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Инструменты для моддинга и творчества находятся в достойном состоянии; однако они не там, где мы хотим их в долгосрочной перспективе. При этом они готовы для игроков, которые хотят создавать контент с первого дня. Это хороший момент для моддеров, владельцев серверов и создателей, чтобы вмешаться заранее! Они сыграют значительную роль в будущем Hytale.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "С момента отмены мы повторно наняли более 40 бывших и новых членов команды, в результате чего их общее число достигло 50. Повторное приобретение игры у AAA-студии и подготовка к запуску в раннем доступе в течение нескольких недель — это редкость, и игроки смогут наблюдать за прогрессом по мере его развития.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Если вам неудобно делать предварительный заказ, не делайте этого. Это настоящий ранний доступ, то есть он еще очень незакончен и какое-то время будет содержать ошибки, но у вас есть мое и нашей командой обязательство сделать Hytale той игрой, которой мы всегда хотели.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Первое впечатление будет тяжелым, но путь вперед имеет большее значение. Более подробная информация появится в ближайшее время. Следите за обновлениями в наших социальных сетях, и мы надеемся увидеть вас 13 января 2026 года.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Спасибо всем за вашу поддержку. Hytale прошла долгий путь, и скоро мы будем дома.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "~ Саймон и вся команда Hytale",
        "style": "normal"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_477eaf50273a8db52724a3fda19a9bf2_modding_banner.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_14e7ce9586e3303868aee27293ba4591_hytale_cursebreaker_key_art_2k.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_1add7a5021e3a42191a30ddc98653d28_header_spring_2025_dev_update.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5efa372e65522954368269461f0f6c8f_winter2024header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_8784c65ad7551359132cda3879f5e3b0_lp_header.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5c3aa9e9095cfd50aff3f6ca275761b2_summer2024_header_5.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_e82dccfffc8df9677ab407f12e3b781f_tech_blog_flecs_header_updated.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_7c5bb6af44f293be3ff60b318d0b5475_winter_update_header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      }
    ]
  },
  "https://hytale.com/news/2025/11/hytale-creative-mode": {
    "blocks": [
      {
        "type": "text",
        "content": "Hytale Creative Mode",
        "style": "header"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_cover_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      },
      {
        "type": "text",
        "content": "Hey everyone! I am Ktar, the Creative Mode engineer on Hytale. I'm excited to show you more about the creative side of Hytale! By swapping to Creative Mode in your world, you can fly around and explore, create, edit, make things explode, and more! We are focused on creating an immersive experience that feels uniquely 'Hytale' while supporting all players and creators with the features they need.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "It's best explained visually, so here is our first video showcasing our Creative Tools that will be available for the upcoming early access!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Now that you've seen the magic tools, let's dive deeper into everything you saw!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Scripted Brushes",
        "style": "header"
      },
      {
        "type": "text",
        "content": "The first thing that I do in the video is take out some of the Scripted Brushes that ship with Hytale. These are simple asset-defined brushes that any modder or user can create more of. Simply drag and drop them into your inventory to create mountains, grassy paths, procedurally generated ruins, and more! You can even edit these scripted brushes in the Hytale Node Editor.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Creative Mode Quick Settings Panel",
        "style": "header"
      },
      {
        "type": "text",
        "content": "The Creative Mode Quick Settings Panel allows you to quickly edit your Creative Mode settings like flight speed, inertia, and more. It also expands and changes depending on the item in your hand to allow you to have even more customizability of your tools.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Player Model Changer / NPC Browser",
        "style": "header"
      },
      {
        "type": "text",
        "content": "You can see our list of over 100 models that you can spawn in your creative world or remix however you want. In this case, I wanted to become a Corgi model, because dogs are the best.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Prefab Browser / Prefab Editor",
        "style": "header"
      },
      {
        "type": "text",
        "content": "I briefly opened the prefab browser on my way to the Prefab Editor. The Prefab Editor is a separate editing environment where you can load a selection of different prefabs into an empty world where you can edit them, select them, or just browse the prefabs visually. In the video, I just go in to select the prefab ruins that I want to paste into my small environment.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Paste Tool",
        "style": "header"
      },
      {
        "type": "text",
        "content": "I now use the Paste Tool to move the prefab to the exact spot that I want before pasting it in. The Paste Tool allows you to precisely place a loaded prefab, or even use a prefab like a brush. You can use the arrow keys to easily make detailed, precise placements of multiblock structures.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Machinima Tool",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Next, I grab the Machinima Tool that looks like a camera, and I create a Camera actor that allows me to specify keyframes to animate the camera movement. After placing all my keyframes, I can adjust the speed and other settings to get the right control I want. The Machinima Tools have a LOT more features that aren't displayed in this quick video. Not only are there many features that I don't show in this video for the tool, but the Machinima Tools are scheduled for a massive upgrade in functionality and user experience in the coming months after launch.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Flying Modes",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Flight in Hytale is very customizable! You can change the speed, controls, flight mode (hover or directional flight), and even the inertia! If you like to stop suddenly, or drift around at high speeds, Hytale is here to support you!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Shape Brush",
        "style": "header"
      },
      {
        "type": "text",
        "content": "The Paintbrush allows you to paint many different shapes of any size into the world. You can do pyramids, cones, squares, and more! You can change the materials, shape, density, wall thickness, axis locked to, masks, and more! The Paintbrush is a very customizable tool that you can use for many purposes, and we hope to only make it better with time!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Selection Tool",
        "style": "header"
      },
      {
        "type": "text",
        "content": "The Selection Tool is another versatile and customizable tool. It allows you to select 3d spaces and perform many different kinds of operations on it. It allows you to save prefabs, paste tons of blocks precisely, move entire objects, define regions, regenerate chunks, extrude, and more! We're looking forward to adding selections that support any shape after release, as well as a \"magic wand\" tool for automatically creating selections by clicking on materials and selecting all of the same material nearby.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Ruler / Laser Pointer Tools",
        "style": "header"
      },
      {
        "type": "text",
        "content": "The Ruler tool allows you to measure distances or mark outlines by placing lines into the world. The Laser Pointer tool allows you to show your friends where to look when words just aren't enough.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Help Menu",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Our development pace is so quick that we've already made last week's help menu screenshot old! The new and improved help menu lets you find creative commands much more quickly and discover new features easily. We hope to continue improving command support via help and new features.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Creative People Using Creative Tools",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Now, for an example of what professional creatives look like using the tools, here are some talented builders with a timelapse castle build that showcases many different types of blocks, flying, brushes, and the Hytale Machinima recording tools. This is an hour of building condensed into about three minutes. Enjoy!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "At the start of the video you can see a lot of terrain being created using the different Creative Mode brushes and tools. First the builder will greybox some terrain using the Stone material on a sphere brush. Then they smooth it and refine the shape using the Smooth tool and some manual building. The next step you'll see is that the builder begins to apply layers of material with multiple brushes and techniques to apply the right colors to the terrain.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "For the castle building, the builders used the Selection Tool, copy, cut, paste, and rotate commands to speed up the building of the shape of the castle. Then, they use the brush tool with a mask (so that it replaces blocks instead of adding new blocks) to set the base layer materials and color of the castle. Then they go in and add all the details by hand.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Currently, the creative experience in Hytale is focused mostly on tools to support content creation. However, we are actively designing a more casual and unique experience to cater to audiences that aren't looking for an editor-like feel, separate from the Adventure and Exploration modes. This additional creative experience will focus on playful interactions over editor features.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Creative Mode allows you, the players, to do so many different things that we can't even explain them all. We can't wait to see you in game!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Community Support",
        "style": "header"
      },
      {
        "type": "text",
        "content": "We are working relentlessly to deliver you a great experience as a creative in Hytale and will keep doing so for years to come. We plan to expand our creative tools team to meet these goals, and we'll work alongside you and the community to improve our tools and features based on your feedback and suggestions!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "I hope to see you in our Hytale Discord's#creative-modechannel, where I'll personally be present, and sometimes pop in to chat with fellow creatives to read your input!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Together, we will shape the future of Creative Mode for Hytale!",
        "style": "normal"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_477eaf50273a8db52724a3fda19a9bf2_modding_banner.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_14e7ce9586e3303868aee27293ba4591_hytale_cursebreaker_key_art_2k.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_1add7a5021e3a42191a30ddc98653d28_header_spring_2025_dev_update.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5efa372e65522954368269461f0f6c8f_winter2024header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_8784c65ad7551359132cda3879f5e3b0_lp_header.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5c3aa9e9095cfd50aff3f6ca275761b2_summer2024_header_5.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_e82dccfffc8df9677ab407f12e3b781f_tech_blog_flecs_header_updated.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_7c5bb6af44f293be3ff60b318d0b5475_winter_update_header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_477eaf50273a8db52724a3fda19a9bf2_modding_banner.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      }
    ],
    "translated": [
      {
        "type": "text",
        "content": "Творческий режим Hytale",
        "style": "header"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_cover_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      },
      {
        "type": "text",
        "content": "Привет всем! Я Ктар, инженер творческого режима в Hytale. Я рад показать вам больше о творческой стороне Hytale! Переключившись в творческий режим в своем мире, вы сможете летать и исследовать, создавать, редактировать, взрывать предметы и многое другое! Мы сосредоточены на создании захватывающего опыта, уникального для Hytale, и при этом поддерживаем всех игроков и создателей необходимыми им функциями.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Лучше всего это объясняется визуально, поэтому вот наше первое видео, демонстрирующее наши творческие инструменты, которые будут доступны в предстоящем раннем доступе!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Теперь, когда вы увидели волшебные инструменты, давайте углубимся во все, что вы видели!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Скриптованные кисти",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Первое, что я делаю в видео, — это достаю несколько скриптовых кистей, которые входят в комплект Hytale. Это простые кисти, определяемые активами, которые любой моддер или пользователь может создать больше. Просто перетащите их в свой инвентарь, чтобы создать горы, травянистые тропы, процедурно генерируемые руины и многое другое! Вы даже можете редактировать эти скриптовые кисти в редакторе узлов Hytale.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Панель быстрых настроек творческого режима",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Панель быстрых настроек творческого режима позволяет быстро редактировать настройки творческого режима, такие как скорость полета, инерция и многое другое. Он также расширяется и меняется в зависимости от предмета в вашей руке, что дает вам еще больше возможностей настройки ваших инструментов.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Сменщик модели игрока / Браузер NPC",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Вы можете просмотреть наш список из более чем 100 моделей, которые вы можете создавать в своем творческом мире или создавать ремиксы по своему усмотрению. В данном случае мне хотелось стать моделью корги, потому что собаки самые лучшие.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Браузер префабов / Редактор префабов",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Я ненадолго открыл браузер префабов по пути к редактору префабов. Редактор префабов — это отдельная среда редактирования, в которой вы можете загружать набор различных префабов в пустой мир, где вы можете редактировать их, выбирать их или просто просматривать префабы визуально. В видео я просто выбираю сборные руины, которые хочу вставить в свою небольшую среду.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Инструмент «Вставить»",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Теперь я использую инструмент «Вставить», чтобы переместить префаб в нужное место, прежде чем вставлять его. Инструмент «Вставить» позволяет точно разместить загруженный префаб или даже использовать префаб как кисть. Вы можете использовать клавиши со стрелками, чтобы легко и точно размещать многоблочные структуры.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Инструмент Машинима",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Затем я беру инструмент Machinima Tool, который выглядит как камера, и создаю актера камеры, который позволяет мне указывать ключевые кадры для анимации движения камеры. После размещения всех ключевых кадров я могу настроить скорость и другие параметры, чтобы получить нужный мне контроль. Инструменты Machinima имеют НАМНОГО больше функций, которые не показаны в этом коротком видео. Мало того, что в этом видео есть множество функций, которые я не показываю в этом видео, но в ближайшие месяцы после запуска Machinima Tools запланировано масштабное обновление функциональности и удобства для пользователей.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Режимы полета",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Полет в Hytale очень настраиваемый! Вы можете изменить скорость, управление, режим полета (зависание или направленный полет) и даже инерцию! Если вам нравится внезапно останавливаться или дрейфовать на высоких скоростях, Hytale здесь, чтобы поддержать вас!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Формирующая кисть",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Кисть позволяет рисовать в мире множество различных фигур любого размера. Вы можете делать пирамиды, конусы, квадраты и многое другое! Вы можете изменить материалы, форму, плотность, толщину стенок, заблокированную ось, маски и многое другое! Кисть — это очень настраиваемый инструмент, который можно использовать для многих целей, и мы надеемся, что со временем он станет только лучше!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Инструмент выбора",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Инструмент «Выделение» — еще один универсальный и настраиваемый инструмент. Он позволяет выбирать трехмерные пространства и выполнять над ними множество различных операций. Он позволяет сохранять префабы, точно вставлять тонны блоков, перемещать целые объекты, определять регионы, регенерировать фрагменты, вытягивать и многое другое! Мы с нетерпением ждем возможности добавить выделения, поддерживающие любую форму, после релиза, а также инструмент «волшебная палочка» для автоматического создания выделений путем щелчка по материалам и выбора всех одинаковых материалов поблизости.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Инструменты линейки/лазерной указки",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Инструмент «Линейка» позволяет измерять расстояния или отмечать контуры, размещая линии в мире. Инструмент «Лазерная указка» позволяет вам показывать друзьям, куда смотреть, когда слов недостаточно.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Меню помощи",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Темпы нашей разработки настолько высоки, что мы уже сделали скриншот меню справки, сделанный на прошлой неделе, устаревшим! Новое улучшенное меню справки позволяет гораздо быстрее находить творческие команды и легко открывать новые функции. Мы надеемся продолжить улучшение поддержки команд с помощью справки и новых функций.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Творческие люди, использующие творческие инструменты",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Теперь, в качестве примера того, как профессиональные креативщики выглядят с использованием этих инструментов, вот несколько талантливых строителей, создавших таймлапс-замок, демонстрирующий множество различных типов блоков, летающих объектов, кистей и инструментов записи Hytale Machinima. Это час строительства, сжатый примерно в три минуты. Наслаждаться!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "В начале видео вы можете увидеть множество ландшафтов, созданных с помощью различных кистей и инструментов творческого режима. Сначала строитель нарисует некоторую местность серой рамкой, используя материал «Камень» на сферической кисти. Затем они сглаживают ее и уточняют форму, используя инструмент «Сглаживание» и немного ручного построения. Следующий шаг, который вы увидите, — это то, что строитель начинает наносить слои материала с помощью нескольких кистей и техник, чтобы применить к местности правильные цвета.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Для строительства замка строители использовали инструмент «Выделение», команды копирования, вырезания, вставки и поворота, чтобы ускорить создание формы замка. Затем они используют инструмент «Кисть» с маской (чтобы он заменял блоки, а не добавлял новые блоки), чтобы установить материалы базового слоя и цвет замка. Затем они заходят и добавляют все детали вручную.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "В настоящее время творческий опыт Hytale сосредоточен в основном на инструментах для поддержки создания контента. Тем не менее, мы активно разрабатываем более непринужденный и уникальный опыт, чтобы удовлетворить аудиторию, которая не ищет ощущения редактора, отдельно от режимов «Приключение» и «Исследование». Этот дополнительный творческий опыт будет сосредоточен на игровом взаимодействии с функциями редактора.",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Творческий режим позволяет вам, игрокам, делать так много разных вещей, что мы даже не сможем объяснить их все. Нам не терпится увидеть вас в игре!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Поддержка сообщества",
        "style": "header"
      },
      {
        "type": "text",
        "content": "Мы неустанно работаем над тем, чтобы вы получили отличный творческий опыт в Hytale, и будем продолжать делать это еще долгие годы. Мы планируем расширить нашу команду по творческим инструментам для достижения этих целей и будем работать вместе с вами и сообществом над улучшением наших инструментов и функций на основе ваших отзывов и предложений!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Я надеюсь увидеть вас на канале #creative-mode нашего Hytale Discord, где я буду лично присутствовать, а иногда и заглядывать в чат с другими творческими людьми, чтобы прочитать ваши отзывы!",
        "style": "normal"
      },
      {
        "type": "text",
        "content": "Вместе мы создадим будущее Creative Mode для Hytale!",
        "style": "normal"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_53c3b1c4954eb5f8ecf24681d3be8586_header2.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_477eaf50273a8db52724a3fda19a9bf2_modding_banner.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_14e7ce9586e3303868aee27293ba4591_hytale_cursebreaker_key_art_2k.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_1add7a5021e3a42191a30ddc98653d28_header_spring_2025_dev_update.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5efa372e65522954368269461f0f6c8f_winter2024header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_8784c65ad7551359132cda3879f5e3b0_lp_header.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_5c3aa9e9095cfd50aff3f6ca275761b2_summer2024_header_5.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_e82dccfffc8df9677ab407f12e3b781f_tech_blog_flecs_header_updated.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_7c5bb6af44f293be3ff60b318d0b5475_winter_update_header.jpg"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_477eaf50273a8db52724a3fda19a9bf2_modding_banner.png"
      },
      {
        "type": "img",
        "src": "https://cdn.hytale.com/variants/blog_thumb_9ec7d3895b7a19a95fdf4b7829d57cde_blogpost_image_early_access__1_.png"
      }
    ]
  }
}