{
  "https://hytale.com/news/2025/11/hytale-modding-strategy-and-status": "Hytale Modding Strategy and Status\n\nPosted by Slikey\n\nNovember 20th 2025\n\nHytale Modding Strategy and Status\n\nHello, I am Slikey (Kevin Carstens), the Technical Director of Hytale.\n\nI want to give you a clear, honest overview of where Hytale modding stands today, what you can expect in the short term, and where we're taking this in the long run.\n\nThis is not a polished marketing post. It's a status report from the people building the game and its tools, written for the people who want to build with us.\n\nHytale gives you a lot of tools to express your creativity and in this post we want to cover the current status and future vision for scripting, programming, modelling and configuration.\n\nMISSION: MODDING AT THE CORE OF HYTALE\n\nWe will always strive to create an immersive adventure for Hytale and continuously expand it in the future. The fortunate fact for modders is that we built the game with the tools that we deliver with the game. Our goal is that anything we do, you can do as well.\n\nAs a modder, you will benefit not just from the tooling we used but also from the content we create to deliver the block game we have always craved for.\n\nWe're building Hytale with modding at its core. Most of what you see in the game can be changed, extended, or removed entirely. Blocks, Items, NPCs, World Generation, UIs, systems, and behaviours are all driven by data and code that you can influence.\n\nIn this post we will talk about the game “client” and the “server”. Usually “servers” are only relevant when joining multiplayer. Hytale is different - even when you join singleplayer, you join a local server that is just for yourself. So when we talk about servers, we mean both singleplayer and multiplayer.\n\nA few key principles guide us:\n\nServer-side first:\n\nAll modding in Hytale is based on the host of the server or host of the game. You should be able to join any modded Hytale server without downloading external mods or juggling client packs. Use any combination of plugins and asset packs to customize your gameplay experience or rely on a server to offer you an experience. You create a singleplayer save and select the mods you want to use for that savegame.\n\nOne community, one client:\n\nWe want to avoid a fragmented ecosystem where every server requires a different modded client. For that reason, we don't intend to support any client mods. The client should remain stable, secure, and consistent, while servers provide the creativity and variation.\n\nModding for longevity:\n\nWe are committing to modding for the long term. We believe modders like us have been looking for a project that doesn't just tolerate them but actively embraces and supports them.\n\nEmpowering modders without exposing players:\n\nWe want modders to benefit from their work and build a future they can rely on, with as much freedom as possible - without exposing players to the security and safety risks that exist on some other modding platforms.\n\nThat's the standard we're holding ourselves to. We're not there yet - but that's the direction.\n\nTECHNICAL REALITY CHECK\n\nNow for the blunt part: we are behind where we want to be.\n\nWe are missing years of development time that we now need to compress into months.\n\nThere are gaps in our tools, our documentation, and the ways systems are exposed.\n\nSome features exist only because they were hacked together during prototyping and never polished.\n\nWe made a deliberate decision:\n\nShip access now instead of waiting for perfection.\n\nWe chose to fix up what we reasonably could in the short time we've had with the project, and then open things up so you can start experimenting while we work toward the long-term modding vision.\n\nWhat this means for you right now:\n\nYou will run into\n\nlimitations\n\ndue to missing editing capabilities.\n\nCertain aspects of\n\nclient behaviour are not yet exposed\n\nto the server.\n\nSome tools and systems are\n\nrough, inconsistent, or painful\n\nto work with.\n\nModding maturity is\n\nwildly uneven\n\ndepending on what you want to build.\n\nWe decided not to hide valuable features just because they're not up to our current standards. If something is useful to you, we'll try to make it available and iterate on it in public.\n\nYou are absolutely encouraged to hold us accountable for that.\n\nHold us responsible for this progress. Tag us, reach out, demand answers. We commit to being transparent and telling you the truth - even if the truth is \"this is not good enough yet\" or \"we don't know yet.\"\n\nDon't just take our word for it. Demand results. Give us feedback. Don't hold back.\n\nCommunity and Communication\n\nYou don't have to figure this out alone. We're anchoring the creator community in a few core places:\n\nDiscord:\n\nOfficial Hytale\n\n,\n\nwhere you can talk directly with us and other modders. There are also other Discords with UGC (User-Generated Content) focus such as\n\nCurseForge\n\n. We may join other Discord communities and listen to you. Discord has been absolutely brilliant in supporting us on setting up the Hytale space\n\n.\n\nX / Reddit:\n\nTweet at us or post on Hytale related subreddits. We can't reply to everything but we are actively scanning posts and comments to guide us. A lot of this post was based on exactly those questions.\n\nDocumentation (GitBook, in progress):\n\nWe are working on public creator documentation hosted on GitBook. This will start incomplete and uneven, but we'll expand it as we go and based on your questions.\n\nCURRENT STATE OF MODDING\n\nWe're currently not satisfied with the state of modding in Hytale.\n\nHowever, we believe that holding access back until everything is perfect would be a disservice. If you join us now, you'll be part of shaping the ecosystem and you'll learn the concepts as they evolve, which will give you a deep understanding over time.\n\nFour Major Content Categories\n\nRight now, Hytale modding largely falls into four technical categories:\n\nServer Plugins - Java .jar files\n\nExtend the functionality of the server programmatically.\n\nExtremely powerful and allows deep modifications to the gameplay experience and core server system.\n\nUse them to build minigames, economies, commands, custom logic, new asset type, and more.\n\nData Assets - JSON files\n\nDrive gameplay behaviour and define core content:\n\nBlocks, items, NPCs\n\nWorld generation\n\nDrop tables, loot, and more.\n\nArt Assets - Sounds, models, textures\n\nProvide the visual and audio representation of game elements.\n\nWe support Blockbench for creating Hytale models, textures, and animations.\n\nSave Files - Worlds and Prefabs\n\nShare whole worlds or specific builds.\n\nPrefabs are used in creative tools and world generation to place prebuilt structures like trees, houses, or large landmarks.\n\nWHY WE'RE NOT ADDING TEXT-BASED SCRIPTING\n\nA common question: \"Where's Lua/scripting?\"\n\nShort answer:\n\nWe do not have text-based scripting and we do not intend to add it.\n\nHere's why:\n\nText-based scripting is usually introduced to \"help non-programmers\" like designers building custom behaviours.\n\nIn reality, script languages like Lua are still programming languages:\n\nProgrammers now have to juggle two languages, one of which usually feels \"nerfed\".\n\nDesigners are still expected to learn actual programming concepts.\n\nIn the end, it's less inclusive and increases complexity for both sides.\n\nWe see that as a false compromise.\n\nOur Direction: Visual Scripting\n\nInstead of text-based scripting, we will add\n\nvisual scripting\n\n:\n\nOur experience with Unreal Engine Blueprints showed us that:\n\nDesigners feel genuinely empowered when they can build logic visually.\n\nProgrammers are more productive when they stay in a programming language (Java/C#) and expose high-level nodes.\n\nThe goal:\n\nDesigners are empowered through a visual language that matches how they think about behaviours.\n\nProgrammers can extend and optimize this system by adding new visual nodes and performance-sensitive implementations.\n\nWe avoid fragmenting logic across multiple \"half-languages\".\n\nWe believe this is the most empowering approach for modders without compromising on capabilities.\n\nTOOLING AVAILABLE TODAY\n\nWe currently offer the following tools for creating Hytale assets:\n\nHytale Asset Editor\n\nEditor for data assets.\n\nSupports most asset types, with notable limitations around NPCs, world generation, and interactions.\n\nThis will expand over time.\n\nBlockbench Plugin\n\nCreate Hytale-compatible models, textures, and animations directly in Blockbench.\n\nReplaces our own modelling and animation tools used in the past to better support established creative workflows in the community.\n\nIntended for release as soon as possible\n\nAsset Graph Editor\n\nAn unfinished internal editor we used as a temporary solution for world generation, creative tool brushes, NPCs and hopefully more soon.\n\nIt is not at the quality bar we want, but it's useful enough that we'd rather expose it and improve it than hide it.\n\nCurrently working on releasing it aswell\n\nMachinima Tools\n\nThe tool we used to create the trailer back in 2018\n\nThey have some technical issues we will need to fix but they are usable and delivered great results for us.\n\nCreative Tools\n\nAn interactive suite of tools to modify the world and express your creativity.\n\nExpect dedicated videos / blogs about them\n\nWe also released some footage of them being used in the past\n\nAnd more..\n\nYou will feel the rough edges. That is expected at this stage, and we intend to fix them with your feedback.\n\nSHORT-TERM IMPROVEMENTS\n\nThis is not a complete roadmap, but it covers the biggest short-term issues we see in terms of urgency and impact for modders.\n\nShared Source Server\n\nWe know that the lack of documentation for assets and systems is causing serious friction. We feel the same pain internally.\n\nWe commit to releasing the\n\nserver source code\n\nas soon as we are legally able to. Expect this within 1-2 months after release.\n\nIn the meantime the server is not obfuscated, so you can decompile it easily.\n\nThis will let you:\n\nInspect how systems work under the hood while documentation is catching up.\n\nUnblock yourself by reading the actual implementation, not guessing from trial and error.\n\nContribute improvements and bug fixes back to us if something bothers you enough that you don't want to wait.\n\nAsset Pack / Mod Distribution\n\nBecause we're releasing the game at this early stage, we did not have time to design a polished, first-class distribution flow.\n\nFor now, expect friction when:\n\nBundling creations into clean, sharable packages.\n\nManaging dependencies between plugins, asset packs, and worlds.\n\nThis is one of our top modding priorities. Expect quick iteration as we see how you actually try to ship and share your work.\n\nCustom UIs\n\nRight now, our UI situation is messy:\n\nWe are using\n\nthree\n\nUI frameworks at the same time.\n\nWe are in the process of ripping out two of them and consolidating on\n\nNoesisGUI\n\n.\n\nNoesis Technologies has been extremely helpful to us, and we want to acknowledge their role in helping make Hytale happen.\n\nWhat this means for you:\n\nWe already have asset-driven UIs, but they are incomplete and limited.\n\nYou can start experimenting with them now.\n\nTell us what you are trying to build and where you get blocked, and we will prioritize unblocking you.\n\nStability\n\nThis one is simple and painful:\n\nThere are crashes.\n\nSome of them are severe and can cause\n\ndata loss\n\n.\n\nOur stance:\n\nWe are fixing crashes as they come in and you can expect rapid improvements.\n\nBut right now, we\n\ncannot guarantee data integrity\n\n.\n\nYou should assume you\n\nwill\n\nbe affected at some point.\n\nPractical advice:\n\nTake frequent backups of your savegames and important creations. We are currently setting up automatic solutions but we can not guarantee safety.\n\nTreat this phase as true early access: valuable, but not yet safe for irreplaceable work.\n\nWe are genuinely sorry for any issues this causes you, and we are treating stability as our top priority.\n\nFirst-Party Server Network\n\nWe plan to launch a first-party server network, operated by an internal team, that offers a selection of classic Hypixel Network-style minigames after launch but work has not started on this yet.\n\nWhy we're doing this\n\nBring back familiar minigames:\n\nOffer experiences you already know from our previous work, rebuilt for Hytale, as well as original new minigames unlocked by Hytale's capabilities.\n\nDogfood our own systems:\n\nUse the same tools and workflows available to you so we can validate and improve minigame creation, live ops, and server management in real conditions.\n\nGather real-world data:\n\nObserve how Hytale servers behave at scale so we can optimize performance, reduce hosting requirements, and drive costs down for everyone.\n\nShare what we learn:\n\nPartially or fully release the code and assets from our minigames so you can study how we build things, reuse components, and adopt best practices.\n\nDe-risk Hytale's early days:\n\nEnsure there is a strong, reliable network of playable content even if community infrastructure takes time to ramp up. Our network's job is to pave the way until we can hand the torch over to you.\n\nWhat we're not trying to do\n\nWe're not trying to outcompete you:\n\nThe goal is not to dominate the server landscape or undercut modders and server owners.\n\nWe're not diluting adventure development:\n\nThis work is done by a dedicated team and does not reduce our focus or investment in Adventure mode.\n\nWe're not using it to ignore feedback:\n\nWe won't bias our roadmap around our own servers at the expense of the wider creator ecosystem or player needs.\n\nUltimately, our incentive is to grow a broad ecosystem with many successful servers and a wide variety of experiences. We do not benefit from having a monopoly inside our own game.\n\nLONG-TERM VISION FOR MODDERS\n\nIn the long term, our goal is to provide a comprehensive suite of tools and services that allow you to flourish in Hytale, regardless of your starting point.\n\nWe want:\n\nNew Modders to enter game creation without needing expensive software or years of experience.\n\nExperienced modders to build complex systems, businesses, and communities on top of Hytale.\n\nHytale to blur the line between \"playing games\" and \"creating games\".\n\nShared Source Server & Bounties\n\nBeyond simply releasing the server source:\n\nWe plan to open\n\ndevelopment bounties\n\nfor specific improvements and features.\n\nThis will take time to set up properly, but the goal is to reward contributions that strengthen the ecosystem.\n\nNode Editor\n\nSome asset types are currently painful to configure in raw JSON, such as:\n\nNPCs\n\nInteractions\n\nWorld generation\n\nWe've been using internal tools to make this manageable. Our plan:\n\nRelease node-graph-style editors for these asset types.\n\nIntegrate these node editors directly into the Hytale Asset Editor, so you have a unified creator suite instead of a patchwork of tools.\n\nconcept vision for the future of the node editor\n\nVisual Scripting\n\nVisual scripting is a core pillar of our long-term vision:\n\nJava plugins will continue to exist and are extremely powerful - but they require programming skills and come with safety concerns.\n\nVisual scripting will:\n\nProvide a\n\nsandboxed\n\n, safe environment for sharing logic.\n\nOffer\n\ngreat learnability and modifiability\n\nfor modders of all skill levels.\n\nAllow programmers to extend it with performance-critical nodes.\n\nOver time, we want to:\n\nBring visual scripting directly into the\n\n3D world\n\n:\n\nLink levers, doors, spawners, triggers, and other elements in-game.\n\nBuild intricate adventure maps and encounters directly inside Hytale.\n\nTake inspiration from systems like DOOM SnapMap while keeping it fully integrated with our asset and scripting stack.\n\nCLOSING WORDS\n\nWe are, very deliberately, in \"early access\" for modders.\n\nThe tools are uneven.\n\nThe documentation is incomplete.\n\nSome workflows feel great, others are frustrating.\n\nThere are crashes, and you will lose work if you don't back up.\n\nWe're not pretending otherwise.\n\nAt the same time:\n\nThese are the tools we used to build Hytale itself.\n\nIn many cases, we were building tools and content in parallel, with modding in mind.\n\nWe know this approach works, because it already produced the game you're seeing.\n\nOur commitment to you:\n\nWe will keep improving the modding experience, step by step.\n\nWe will focus on learnability, onboarding, and the ability to \"ramp up\" from beginner to expert.\n\nWe will be transparent about what's ready, what's not, and what we're prioritizing next.\n\nAnd we will listen when you tell us where it hurts.\n\nIf you're willing to join us in this phase - bugs, rough edges and all - you won't just be modding Hytale. You'll be shaping what Hytale modding becomes.\n\nI know there are a lot of details missing and you probably have more questions than before. I will be on our Hytale Discord server chat (Modding / Creative > #discussion) on Saturday, 22nd November 2025 at 12pm EST / 5pm GMT to answer your questions for a full hour and reply to as many questions as I can.\n\nSee you in your version of Orbis,\n\nSlikey\n\nHytale Early Access: January 13, 2026\n\nNovember 28th 2025\n\nHytale Creative Mode\n\nNovember 25th 2025\n\nHytale Modding Strategy and Status\n\nNovember 20th 2025\n\nHYTALE IS SAVED!\n\nNovember 17th 2025\n\nSpring 2025 Development Update\n\nMarch 28th 2025\n\nWinter 2024 Development Update\n\nDecember 17th 2024\n\nTechnical Explainer: Powering Up with Launch Pads\n\nDecember 10th 2024\n\nSummer 2024 Development Update\n\nJuly 29th 2024\n\nSummer 2024 Technical Explainer: Hytale's Entity Component System\n\nJune 17th 2024\n\nWinter 2023 Development Update\n\nNovember 30th 2023\n\nPrevious post\n\nHYTALE IS SAVED!\n\nNovember 17th 2025\n\nNext post\n\nHytale Creative Mode\n\nNovember 25th 2025",
  "https://hytale.com/news/2025/11/hytale-early-access-january-13-2026": "Hytale Early Access: January 13, 2026\n\nPosted by Hytale Team\n\nNovember 28th 2025\n\nHytale enters early access on January 13, 2026.\n\nPre-purchase opens December 13, 2025.\n\nTwo weeks ago, we, the original founders, repurchased Hytale, months after it was cancelled. We revived the project, and we are returning to a four-year-old legacy build that had been abandoned. We are personally committing funding for many years to come.\n\nWe stepped away from the newer engine, which was intended to be a complete cross-platform rewrite, and we are now focused on reviving the original version. This required picking, choosing, and merging more than 300 GitHub branches into a single working branch. It was a significant engineering effort, but we’re now confident enough to launch early access.\n\nHytale and Hypixel Studios are independent again, and we are returning to the original vision from the 2018 trailer. Because we went back to an older game build that was now meant for prototypes, some parts of the game will feel behind, but momentum is strong, and we’re working fast to make this into the game we all dreamed of.\n\nModding and creative tools are in a decent state; however, they’re not where we want them long term. That being said, they’re ready for players who want to create content on day 1. This is a good moment for modders, server owners, and creators to step in early! They will play a significant role in Hytale’s future.\n\nSince the cancellation, we’ve rehired more than 40 former and new team members, bringing the total to 50. Reacquiring a game from a AAA studio and preparing an early access launch within weeks is rare, and players will be able to watch the progress as it happens.\n\nIf you don’t feel comfortable pre-ordering, please don’t. This is true early access, meaning it’s still very much unfinished and will be buggy for a while, but you have my and the team's commitment to make Hytale the game we’ve always wanted it to be.\n\nThe first impression will be rough, but the path ahead matters more. More details are coming soon. Follow our social channels for updates, and we hope to see you on January 13, 2026.\n\nThank you, everyone, for your support. Hytale has been through a long journey, and soon, we will be home.\n\n~ Simon and the entire Hytale team\n\nHytale Early Access: January 13, 2026\n\nNovember 28th 2025\n\nHytale Creative Mode\n\nNovember 25th 2025\n\nHytale Modding Strategy and Status\n\nNovember 20th 2025\n\nHYTALE IS SAVED!\n\nNovember 17th 2025\n\nSpring 2025 Development Update\n\nMarch 28th 2025\n\nWinter 2024 Development Update\n\nDecember 17th 2024\n\nTechnical Explainer: Powering Up with Launch Pads\n\nDecember 10th 2024\n\nSummer 2024 Development Update\n\nJuly 29th 2024\n\nSummer 2024 Technical Explainer: Hytale's Entity Component System\n\nJune 17th 2024\n\nWinter 2023 Development Update\n\nNovember 30th 2023\n\nPrevious post\n\nHytale Creative Mode\n\nNovember 25th 2025",
  "https://hytale.com/news/2025/11/hytale-creative-mode": "Hytale Creative Mode\n\nPosted by Ktar\n\nNovember 25th 2025\n\nHey everyone! I am Ktar, the Creative Mode engineer on Hytale. I'm excited to show you more about the creative side of Hytale! By swapping to Creative Mode in your world, you can fly around and explore, create, edit, make things explode, and more! We are focused on creating an immersive experience that feels uniquely 'Hytale' while supporting all players and creators with the features they need.\n\nIt's best explained visually, so here is our first video showcasing our Creative Tools that will be available for the upcoming early access!\n\nNow that you've seen the magic tools, let's dive deeper into everything you saw!\n\nScripted Brushes\n\nThe first thing that I do in the video is take out some of the Scripted Brushes that ship with Hytale. These are simple asset-defined brushes that any modder or user can create more of. Simply drag and drop them into your inventory to create mountains, grassy paths, procedurally generated ruins, and more! You can even edit these scripted brushes in the Hytale Node Editor.\n\nCreative Mode Quick Settings Panel\n\nThe Creative Mode Quick Settings Panel allows you to quickly edit your Creative Mode settings like flight speed, inertia, and more. It also expands and changes depending on the item in your hand to allow you to have even more customizability of your tools.\n\nPlayer Model Changer / NPC Browser\n\nYou can see our list of over 100 models that you can spawn in your creative world or remix however you want. In this case, I wanted to become a Corgi model, because dogs are the best.\n\nPrefab Browser / Prefab Editor\n\nI briefly opened the prefab browser on my way to the Prefab Editor. The Prefab Editor is a separate editing environment where you can load a selection of different prefabs into an empty world where you can edit them, select them, or just browse the prefabs visually. In the video, I just go in to select the prefab ruins that I want to paste into my small environment.\n\nPaste Tool\n\nI now use the Paste Tool to move the prefab to the exact spot that I want before pasting it in. The Paste Tool allows you to precisely place a loaded prefab, or even use a prefab like a brush. You can use the arrow keys to easily make detailed, precise placements of multiblock structures.\n\nMachinima Tool\n\nNext, I grab the Machinima Tool that looks like a camera, and I create a Camera actor that allows me to specify keyframes to animate the camera movement. After placing all my keyframes, I can adjust the speed and other settings to get the right control I want. The Machinima Tools have a LOT more features that aren't displayed in this quick video. Not only are there many features that I don't show in this video for the tool, but the Machinima Tools are scheduled for a massive upgrade in functionality and user experience in the coming months after launch.\n\nFlying Modes\n\nFlight in Hytale is very customizable! You can change the speed, controls, flight mode (hover or directional flight), and even the inertia! If you like to stop suddenly, or drift around at high speeds, Hytale is here to support you!\n\nShape Brush\n\nThe Paintbrush allows you to paint many different shapes of any size into the world. You can do pyramids, cones, squares, and more! You can change the materials, shape, density, wall thickness, axis locked to, masks, and more! The Paintbrush is a very customizable tool that you can use for many purposes, and we hope to only make it better with time!\n\nSelection Tool\n\nThe Selection Tool is another versatile and customizable tool. It allows you to select 3d spaces and perform many different kinds of operations on it. It allows you to save prefabs, paste tons of blocks precisely, move entire objects, define regions, regenerate chunks, extrude, and more! We're looking forward to adding selections that support any shape after release, as well as a \"magic wand\" tool for automatically creating selections by clicking on materials and selecting all of the same material nearby.\n\nRuler / Laser Pointer Tools\n\nThe Ruler tool allows you to measure distances or mark outlines by placing lines into the world. The Laser Pointer tool allows you to show your friends where to look when words just aren't enough.\n\nHelp Menu\n\nOur development pace is so quick that we've already made last week's help menu screenshot old! The new and improved help menu lets you find creative commands much more quickly and discover new features easily. We hope to continue improving command support via help and new features.\n\nCreative People Using Creative Tools\n\nNow, for an example of what professional creatives look like using the tools, here are some talented builders with a timelapse castle build that showcases many different types of blocks, flying, brushes, and the Hytale Machinima recording tools. This is an hour of building condensed into about three minutes. Enjoy!\n\nAt the start of the video you can see a lot of terrain being created using the different Creative Mode brushes and tools. First the builder will greybox some terrain using the Stone material on a sphere brush. Then they smooth it and refine the shape using the Smooth tool and some manual building. The next step you'll see is that the builder begins to apply layers of material with multiple brushes and techniques to apply the right colors to the terrain.\n\nFor the castle building, the builders used the Selection Tool, copy, cut, paste, and rotate commands to speed up the building of the shape of the castle. Then, they use the brush tool with a mask (so that it replaces blocks instead of adding new blocks) to set the base layer materials and color of the castle. Then they go in and add all the details by hand.\n\nCurrently, the creative experience in Hytale is focused mostly on tools to support content creation. However, we are actively designing a more casual and unique experience to cater to audiences that aren't looking for an editor-like feel, separate from the Adventure and Exploration modes. This additional creative experience will focus on playful interactions over editor features.\n\nCreative Mode allows you, the players, to do so many different things that we can't even explain them all. We can't wait to see you in game!\n\nCommunity Support\n\nWe are working relentlessly to deliver you a great experience as a creative in Hytale and will keep doing so for years to come. We plan to expand our creative tools team to meet these goals, and we'll work alongside you and the community to improve our tools and features based on your feedback and suggestions!\n\nI hope to see you in our Hytale Discord's\n\n#creative-mode\n\nchannel, where I'll personally be present, and sometimes pop in to chat with fellow creatives to read your input!\n\nTogether, we will shape the future of Creative Mode for Hytale!\n\n-Ktar\n\nHytale Early Access: January 13, 2026\n\nNovember 28th 2025\n\nHytale Creative Mode\n\nNovember 25th 2025\n\nHytale Modding Strategy and Status\n\nNovember 20th 2025\n\nHYTALE IS SAVED!\n\nNovember 17th 2025\n\nSpring 2025 Development Update\n\nMarch 28th 2025\n\nWinter 2024 Development Update\n\nDecember 17th 2024\n\nTechnical Explainer: Powering Up with Launch Pads\n\nDecember 10th 2024\n\nSummer 2024 Development Update\n\nJuly 29th 2024\n\nSummer 2024 Technical Explainer: Hytale's Entity Component System\n\nJune 17th 2024\n\nWinter 2023 Development Update\n\nNovember 30th 2023\n\nPrevious post\n\nHytale Modding Strategy and Status\n\nNovember 20th 2025\n\nNext post\n\nHytale Early Access: January 13, 2026\n\nNovember 28th 2025"
}